/****************************************************
** Задача 47. Задайте двумерный массив размером m×n,*    
** заполненный случайными вещественными числами.    *
** m = 3, n = 4.                                    *
** 0,5     7       -2      -0,2                     *
** 1      -3,3      8      -9,9                     *
** 8       7,8     -7,1     9                       *
*****************************************************/

(int rows, int cols) GetInput()
{
    int[] size = new int[0];
    do
    {
        Console.Clear();
        Console.Write("Enter amount of rows and cols separated by space: ");
        size = Console.ReadLine()?.Split(',', ' ')
            .Where(item => int.TryParse(item, out _))
            .Select(item => Convert.ToInt32(item))
            .ToArray() ?? new int[0];
    } while (size.Length < 2);
    return (size[0], size[1]);
}

double[,] GetRealArray((int rows, int cols) size)
{
    double[,] array = new double[size.rows, size.cols];

    for (int row = 0; row < size.rows; row++)
        for (int col = 0; col < size.cols; col++)
            array[row, col] = new Random().NextDouble() * 100;            
    
    return array;
}

void Print(double[,] array)
{
    for (int row = 0; row < array.GetLength(0); row++)
    {    
        for (int col = 0; col < array.GetLength(1); col++)
            Console.Write($"{array[row, col],8:0.00}");
        Console.WriteLine();
    }
}

/////////////////////////////////////////////////////////////////////////////////////
(int rows, int cols) size = GetInput();
double[,] realNumbers = GetRealArray(size);
Print(realNumbers);

/*
OUTPUT====================================================
Enter amount of rows and cols separated by space: 6 6
    57.89   61.51   67.82   59.68   28.65   85.50
    45.99   18.49   74.59   31.82   36.06   75.56
    29.40   44.35   96.62    1.50   26.42   81.06
    38.76   12.75   65.30   43.08   69.66   37.24
     4.16   92.68   35.82   43.77   51.53   34.42
    63.33   98.53   44.62    8.13   31.46   13.55
==========================================================
Enter amount of rows and cols separated by space: 10 15
   76.40   60.33   50.14   39.15   75.50   23.41   67.67   38.21   16.65   36.23    9.93   84.92   81.85   74.01   92.34
   14.54    7.99   80.63   25.14   86.92   49.76   25.68   51.52   36.18    8.05    5.03   36.90   76.02   66.52   69.44
   54.47   45.51   70.36   73.93   33.45   54.23   28.84   49.04   37.38   63.24   97.72   14.73   71.56   73.37    8.03
   71.45   37.94   35.32    1.47   98.11   18.32   77.46   67.16   58.90   80.07   47.60    3.33   64.91   25.14   35.48
   99.40   72.29   68.07   54.85   93.15   17.10   15.11   65.07   42.72   62.99   19.86   26.05   50.88   83.16   50.06
   29.25   85.05   19.68    3.11   95.17   45.06   97.07   35.61   36.67   31.05   83.34   55.15   54.67   75.21   86.48
    0.54   78.87   14.41   35.07   52.08   19.13   13.50   37.70   88.94   15.07   10.32   92.15   90.20   79.23   32.09
   41.18   66.86   58.43   84.76   75.55   44.13   77.11   40.09   89.07   13.71   18.02   27.99    2.91   45.92   98.87
   41.37   36.08    8.43   81.69   19.38   27.52   60.68   52.01   37.01   58.81   42.37   43.26   64.49   97.39   50.48
   41.81   76.34    6.49   60.40   83.05   14.25   49.71   59.54    8.72    5.74   72.03    1.64   64.93   69.91   76.80
*/