/*    
 *    Задача 64: Задайте значение N. 
 *    Напишите программу, которая выведет все натуральные числа в промежутке от N до 1. 
 *    Выполнить с помощью рекурсии.
 */

int number = new Random().Next(5, 15);
Console.Write($"N = {number} -> ");
PrintRange(number);

void PrintRange(int num)
{
    if (num == 1)
    {
        Console.Write(num);
        return;
    }
    Console.Write($"{num}, ");
    PrintRange(num - 1);
}

/*
 * OUTPUT=========================================================
 * N = 13 -> 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1
 * OUTPUT=========================================================
 * N = 6 -> 6, 5, 4, 3, 2, 1
 */